Repository: aklib/homepage
Catalog: module/Application/language/*.po
Languages: de_de, ru_ru

source: Additional information
de_de: Zusätzliche Information
ru_ru: Дополнительная информация

source: Previous exceptions
de_de: Vorherige Ausnahme
ru_ru: Предыдущие исключения

source: No Exception available
de_de: Es ist keine Ausnahme verfügbar
ru_ru: Исключений нет

source: An error occurred
de_de: Ein Fehler ist aufgetreten
ru_ru: Произошла ошибка

source: Message
de_de: Meldung
ru_ru: Сообщение

source: Alexej Kisselev
ru_ru: Алексей Киселёв

source: Über mich
ru_ru: Обо мне

source: Kompetenz
ru_ru: Компетенция

source: Berufserfahrung
ru_ru: Опыт работы

source: Ausbildung
ru_ru: Образование

source: Ich bin
ru_ru: &nbsp;

source: Softwareentwickler
ru_ru: разработчик ПО

source: Staatlich geprüfter Informatiker
ru_ru: сертифицированный специалист по информатике

source: Diplom-Ingenieur (FH/BY)
ru_ru: дипломированный инженер

source: Download CV
ru_ru: Скачать резюме (de)

source: Ich bin leidenschaftlicher
ru_ru: Я -

source: Programmierer
ru_ru: Программист

source: Radiotechnische Fachhochschule Minsk
ru_ru: Минский радиотехнический институт

source: Studium der Ingenieur-Elektrik
ru_ru: Инженер электронщик

source: Schwerpunkte
ru_ru: Ключевые направления

source: Produktionsautomatisierung, Automatik und Telemecanique, Produktionsroboter
ru_ru: Автоматика и телемеханика, производственные роботы

source: Abschluss
ru_ru: Диплом

source: Adresse
ru_ru: Адрес

source: Deutschland, Köln
ru_ru: Германия, Кёльн

source: Alter
ru_ru: Возраст

source: Jahre
ru_ru: лет

source: Geburtsort
ru_ru: Место рождения

source: Minsk, Weißrussland, UdSSR
ru_ru: Минск, Беларусь, СССР

source: Sprachen
ru_ru: Языки

source: #about competence
de_de: Als Softwareingenieur mit über vierzehn Jahren Erfahrung biete ich umfangreiche Kompetenzen in der Entwicklung von Web-Applikationen in PHP und Java. Erfahren mit allen Phasen des Entwicklungszyklus für dynamische Web-Projekte
ru_ru: Как инженер-программист с более чем четырнадцатилетним опытом работы, я обладаю обширными навыками разработки веб-приложений на PHP и Java. Имеет опыт работы на всех этапах цикла разработки динамических веб-проектов

source: #service competence
de_de: Konzeption, Implementierung und Umsetzung von Projekten im komplexen Product Information Management&nbsp;(&nbsp;PIM&nbsp;) und im Media Asset Management&nbsp;(&nbsp;MAM&nbsp;) ist meine Kernkompetenz
ru_ru: Концепция, реализация и внедрение проектов в области комплексного управления информацией о продуктах (PIM) и управления медиа-активами (MAM) - моя основная компетенция

source: #service php
de_de: Entwicklung von komplexe Backends auf Basis von Zend Framework 2/3 und Doctrine ORM-Framework mit dem Apache Webserver und Elasticsearch Suchmaschine
ru_ru: Разработка сложных бэкэндов на основе Zend Framework 2/3 и Doctrine ORM-Framework с Apache Webserver и поисковой системой Elasticsearch

source: #service java
de_de: Entwicklung von komplexe Geschäftslogik auf Basis von Maven Build-Management-Tool und Hibernate ORM-Framework mit dem Tomcat Application Server und Elasticsearch Suchmaschine
ru_ru: Разработка комплексной бизнес-логики на основе инструмента управления сборкой Maven и фреймворка Hibernate ORM с сервером приложений Tomcat и поисковой системой Elasticsearch

source: #service sql
de_de: Entwicklung von konsistenter MySQL/-PostgreSQL relationale Datenbanken, um eine fehlerfreie Bereitstellung von Daten zu gewährleisten. Datenbankabfragen führen schnell zum Ziel
ru_ru: Разработка последовательных реляционных баз данных MySQL/-PostgreSQL для обеспечения безошибочной работы с данными. Запросы к базе данных быстро приводят к цели

source: #service oop
de_de: Mein Programmierparadigma ist die Objekt Orientierte Programmierung ( OOP ). Die Flexibilität und Wiederverwendbarkeit von Modulen, Klassen und Methoden spart Zeit und senkt dadurch Entwicklungskosten
ru_ru: Моя парадигма - объектно&nbsp;ориентированное программирование&nbsp;(&nbsp;OOP&nbsp;). Гибкость и возможность повторного использования модулей, классов и методов экономит время и снижает затраты на разработку

source: #service security
de_de: Implementation von schützende Maßnahmen wie serverseitiges Validieren von Formdaten, <q>Prepared Statements</q> gegen SQL-Injection, Escape-Funktionen gegen HTML-Injection und vieles mehr
ru_ru: Реализация таких защитных мер, как серверная валидация данных форм, <q>prepared statements</q> против SQL-injection, escape-функции против HTML-injection и многое другое

source: #service code
de_de: Praktiken wie <q>Clean Code<q> und statische Analyse erlauben es, praktisch fehlerfreien Code zu schreiben und das auch noch mit weniger Aufwand. Codequalität erleichtert vesentlich eine Zusammenarbeit in Entwicklerteam
ru_ru: Такие практики, как <q>Clean Code</q> и статический анализ, позволяют писать практически безошибочный код с меньшими затратами. Благодаря качеству кода значительно легче работать в команде разработчиков

source: #home bg
de_de: Schwarzwald, Silvester 2019-2020
ru_ru: Шварцвальд, канун Нового 2020 года

source: gehören dazu
ru_ru: прилагаются

source: Chef, schnell oder gut
ru_ru: Босс, быстро или хорошо

source: Familienphase
ru_ru: Семейный этап

source: Softwarearchitektur, Design und Konzeption eines PIM (Product&nbsp;Information&nbsp;Management) mit MAM/DAM (Media/Data Asset Management) und mehreren APIs
ru_ru: Архитектура программного обеспечения, дизайн и концепция PIM (Product&nbsp;Information&nbsp;Management) с MAM/DAM (Media/Data Asset Management) и несколькими API

source: Softwarearchitektur, Design und Konzeption von WEB-Anwendungen
ru_ru: Архитектура программного обеспечения, дизайн и концепция WEB-приложений

source: Datenbankdesign und -tuning
ru_ru: Дизайн и тюнинг баз данных

source: Einsatz von OOP zur schnelleren Programmierung von WEB-Seiten
ru_ru: Применение ООП для более оперативного программирования WEB-страниц

source: Analyse, Design und Konzeption verteilter Anwendungen (Webentwicklung/ Mobile Applikationen)
ru_ru: Анализ, дизайн и концепция разветвленных приложений (веб-разработка / мобильные приложения)

source: Datenbankdesign und -Tuning
ru_ru: Дизайн и тюнинг баз данных

source: Datenbankentwickler
ru_ru: Разработчик баз данных

source: Evangelischer Fachverband Schuldnerberatung
ru_ru: Профессиональная евангельская ассоциация по консультированию по вопросам задолженности

source: Access-Datenbank Tuning
ru_ru: Тюнинг баз данных MS Access

source: Weiterbildung
ru_ru: Дальнейшее обучение

source: Bildungszentrum für Informationsverarbeitende Berufe
ru_ru: Учебный центр по профессиям, связанным с обработкой информации

source: Weiterbildung zum Staatlich geprüften Informatiker
ru_ru: Повышение квалификации для получения государственного сертификата специалиста по вычислительной технике

source: Staatlich geprüfter Informatiker, Fachrichtung Softwaretechnologie
ru_ru: Государственный сертифицированный специалист в области компьютерных технологий, специализирующийся на технологиях программного обеспечения

source: Sprachkurs Deutsch
ru_ru: Курс немецкого языка

source: Berlitz Sprachschule Wuppertal
ru_ru: Языковой центр 'Berlitz' в Вуппертале

source: Übersiedlung nach Deutschland und Integrationsphase mit Sprachkurs Deutsch
ru_ru: Переезд в Германию и этап интеграции с курсом немецкого языка

source: Studium
ru_ru: Высшее образование

source: Hobbys &amp; Interessen
ru_ru: Хобби &amp; интересы

source: Programmierer sind auch nur Menschen
ru_ru: Программисты тоже люди

source: Programmierung
ru_ru: Программирование

source: Kino
ru_ru: Кино

source: Kaffee
ru_ru: Кофе

source: Sports
ru_ru: Спорт

source: Geschichte
ru_ru: История

source: Haustiere
ru_ru: Домашние животные

source: Politik
ru_ru: Политика

source: Waffensysteme
ru_ru: Оружейные системы

source: Seit
ru_ru: с

source: deutsch
ru_ru: немецкий

source: russisch
ru_ru: русский

source: english
ru_ru: английский

source: Softwarearchitektur, Design und Konzeption eines PIM (Product Information Management) mit MAM/DAM (Media/Data Asset Management) und mehreren APIs
ru_ru: Архитектура программного обеспечения, дизайн и концепция PIM (Product Information Management) с MAM/DAM (Media/Data Asset Management) и несколькими API

source: Literatur
ru_ru: Литература

source: File
de_de: Datei

source: Stack trace
de_de: Stapelüberwachung
